====================| Model Summary |====================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Linear: 1-1                            [-1, 128, 128]            10,240
├─SinusoidalEncoding: 1-2                [-1, 128, 128]            --
├─ModuleList: 1                          []                        --
|    └─DecoderBlock: 2-1                 [-1, 128, 128]            --
|    |    └─MultiHeadAttention: 3-1      [-1, 128, 128]            --
|    |    |    └─Linear: 4-1             [-1, 128, 384]            49,152
|    |    |    └─Dropout: 4-2            [-1, 4, 128, 128]         --
|    |    |    └─Linear: 4-3             [-1, 128, 128]            16,512
|    |    |    └─Dropout: 4-4            [-1, 128, 128]            --
|    |    └─LayerNorm: 3-2               [-1, 128, 128]            256
|    |    └─FeedForwardNetwork: 3-3      [-1, 128, 128]            --
|    |    |    └─Linear: 4-5             [-1, 128, 512]            66,048
|    |    |    └─Linear: 4-6             [-1, 128, 128]            65,664
|    |    |    └─Dropout: 4-7            [-1, 128, 128]            --
|    |    └─LayerNorm: 3-4               [-1, 128, 128]            256
|    └─DecoderBlock: 2-2                 [-1, 128, 128]            --
|    |    └─MultiHeadAttention: 3-5      [-1, 128, 128]            --
|    |    |    └─Linear: 4-8             [-1, 128, 384]            49,152
|    |    |    └─Dropout: 4-9            [-1, 4, 128, 128]         --
|    |    |    └─Linear: 4-10            [-1, 128, 128]            16,512
|    |    |    └─Dropout: 4-11           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-6               [-1, 128, 128]            256
|    |    └─FeedForwardNetwork: 3-7      [-1, 128, 128]            --
|    |    |    └─Linear: 4-12            [-1, 128, 512]            66,048
|    |    |    └─Linear: 4-13            [-1, 128, 128]            65,664
|    |    |    └─Dropout: 4-14           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-8               [-1, 128, 128]            256
|    └─DecoderBlock: 2-3                 [-1, 128, 128]            --
|    |    └─MultiHeadAttention: 3-9      [-1, 128, 128]            --
|    |    |    └─Linear: 4-15            [-1, 128, 384]            49,152
|    |    |    └─Dropout: 4-16           [-1, 4, 128, 128]         --
|    |    |    └─Linear: 4-17            [-1, 128, 128]            16,512
|    |    |    └─Dropout: 4-18           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-10              [-1, 128, 128]            256
|    |    └─FeedForwardNetwork: 3-11     [-1, 128, 128]            --
|    |    |    └─Linear: 4-19            [-1, 128, 512]            66,048
|    |    |    └─Linear: 4-20            [-1, 128, 128]            65,664
|    |    |    └─Dropout: 4-21           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-12              [-1, 128, 128]            256
|    └─DecoderBlock: 2-4                 [-1, 128, 128]            --
|    |    └─MultiHeadAttention: 3-13     [-1, 128, 128]            --
|    |    |    └─Linear: 4-22            [-1, 128, 384]            49,152
|    |    |    └─Dropout: 4-23           [-1, 4, 128, 128]         --
|    |    |    └─Linear: 4-24            [-1, 128, 128]            16,512
|    |    |    └─Dropout: 4-25           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-14              [-1, 128, 128]            256
|    |    └─FeedForwardNetwork: 3-15     [-1, 128, 128]            --
|    |    |    └─Linear: 4-26            [-1, 128, 512]            66,048
|    |    |    └─Linear: 4-27            [-1, 128, 128]            65,664
|    |    |    └─Dropout: 4-28           [-1, 128, 128]            --
|    |    └─LayerNorm: 3-16              [-1, 128, 128]            256
├─Linear: 1-3                            [-1, 128, 80]             10,320
├─PostMelSpecBlock: 1-4                  [-1, 128, 80]             --
|    └─Conv1d: 2-5                       [-1, 320, 128]            128,320
|    └─ModuleList: 2                     []                        --
|    |    └─Conv1d: 3-17                 [-1, 320, 128]            512,320
|    |    └─Conv1d: 3-18                 [-1, 320, 128]            512,320
|    └─Conv1d: 2-6                       [-1, 80, 128]             128,080
├─Linear: 1-5                            [-1, 128, 1]              128
==========================================================================================
Total params: 2,093,280
Trainable params: 2,093,280
Non-trainable params: 0
Total mult-adds (M): 167.50
==========================================================================================
Input size (MB): 0.08
Forward/backward pass size (MB): 6.72
Params size (MB): 7.99
Estimated Total Size (MB): 14.78
==========================================================================================